test/svt/jmeter/plans/opa-direct-scenario.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Direct OPA Scenario SVT" enabled="true">
      <stringProp name="TestPlan.comments">Generic direct OPA scenario runner for authz-agent.
Scenario requests come from CSV with one prebuilt OPA input envelope per row.
Tokens are passed via properties file: token_${username}.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">${__P(threads,30)}</stringProp>
          </elementProp>
          <elementProp name="RAMP_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">RAMP_SECONDS</stringProp>
            <stringProp name="Argument.value">${__P(ramp_seconds,5)}</stringProp>
          </elementProp>
          <elementProp name="DURATION_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">DURATION_SECONDS</stringProp>
            <stringProp name="Argument.value">${__P(duration_seconds,60)}</stringProp>
          </elementProp>
          <elementProp name="OPA_HOST" elementType="Argument">
            <stringProp name="Argument.name">OPA_HOST</stringProp>
            <stringProp name="Argument.value">${__P(opa_host,opa)}</stringProp>
          </elementProp>
          <elementProp name="OPA_PORT" elementType="Argument">
            <stringProp name="Argument.name">OPA_PORT</stringProp>
            <stringProp name="Argument.value">${__P(opa_port,8181)}</stringProp>
          </elementProp>
          <elementProp name="TARGET_RPS" elementType="Argument">
            <stringProp name="Argument.name">TARGET_RPS</stringProp>
            <stringProp name="Argument.value">${__P(target_rps,500)}</stringProp>
          </elementProp>
          <elementProp name="SCENARIO_CSV" elementType="Argument">
            <stringProp name="Argument.name">SCENARIO_CSV</stringProp>
            <stringProp name="Argument.value">${__P(scenario_csv,/scenario/requests.csv)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OPA Direct Scenario" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION_SECONDS}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="scenario-requests.csv" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${SCENARIO_CSV}</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">username,scenarioLabel,requestClass,expectedDecision,requestBodyTemplate</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Rate Limiter" enabled="true">
          <stringProp name="throughput">${__jexl3(${TARGET_RPS} * 60)}</stringProp>
          <intProp name="calcMode">2</intProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Resolve Token + Build Body" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">def username = vars.get("username")
def tokenKey = "token_" + username.replace("-", "_")
def token = props.get(tokenKey) ?: ""
vars.put("auth_token", token)
def template = vars.get("requestBodyTemplate") ?: ""
vars.put("request_body", template.replace("__TOKEN__", token))
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /v1/data/authorize" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${request_body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${OPA_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${OPA_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/v1/data/authorize</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Label + Validate" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">def scenarioLabel = vars.get("scenarioLabel") ?: "scenario"
def requestClass = vars.get("requestClass") ?: "OPA"
def expectedDecision = vars.get("expectedDecision") ?: "ALLOW"
prev.setSampleLabel(prev.getSampleLabel() + " [" + scenarioLabel + "|" + requestClass + "|" + expectedDecision + "]")
if (prev.getResponseCode() == "200") {
    def body = prev.getResponseDataAsString()
    def actual = body.contains('"isAllowed":false') ? "DENY" : "ALLOW"
    if (actual != expectedDecision) {
        prev.setSuccessful(false)
        prev.setResponseMessage("Expected " + expectedDecision + " but got " + actual)
    }
}
            </stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>